import numpy as np

"""Черное зеркало, угол 50 градусов"""
degreeses_step_10 = np.arange(0, 190, 10)
dark_mirror = np.array([
    22.6, 16.2, 12, 7.4, 4.1, 3.3, 4.6, 7.8, 13.1, 18.9, 25, 30.5, 35.1, 38.1, 38.5, 37, 33.3, 28, 22.6
])


"""Угол Брюстера для угла поворота 50 градусов, Минимальное значение"""
bruster_min = np.array([
    13.6, 12.6, 12.3, 11.1, 9.1, 7.4, 5.4, 3.2, 1.6, 1.2, 0.9, 0.8, 0.6, 0.7, 2.8, 11.4, 30.8, 30.9
])

brust_50_degreeses = np.array([
    15, 20, 25, 30, 35, 40, 45, 50, 55, 56, 57, 58, 59, 60, 65, 70, 75, 80
])



"""Угол Брюстера для угла поворота 140 градусов, Максимальное значение"""
bruster_140_degrees = np.array([
    15, 20, 25, 30, 35, 40, 45, 50, 55, 56, 57, 58, 59, 60, 65, 70, 75, 80
])

bruster_max = np.array([
    14.4, 15.5, 17.1, 19.4, 22.6, 26.9, 31.1, 38.5, 46.8, 50.2, 53.9, 56.8, 58.5, 61.8, 81.0, 100.4, 123.1, 162.3
])

"""Без Фазовой пластинки"""
no_phase_degrees = np.arange(0, 190, 10)
no_phase = np.array([
    1.4, 7.1, 26.7, 49.9, 86, 123.7, 157, 184, 202, 209, 204, 186, 158, 125, 88, 49, 24, 6.8, 1.4
])


"""С пластинкой
Минимум 0 градусов, максимум 270 градусов
Угол 315 градусов
"""
plast_degrees = np.arange(0, 190, 10)
plast = np.array([
    173, 166, 153, 130, 103, 67, 39, 17.8, 6.7, 2.65, 7.5, 22.7, 45, 74.6, 104.9, 132, 154.7, 170.1, 174
])
